0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 8.2134e-8;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 8.2134e-8;
    }
    outlet
    {
        type            zeroGradient;
            }
    frontAndBack
    {
        type            empty;
    }
    walls
    {
        type            kqRWallFunction;
	value           uniform 8.2134e-8;
    }

}


// ************************************************************************* //
