0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.76e-5;

boundaryField
{
    inlet
    {
         type            calculated;
	 value           uniform 1.76e-5;
    }
    outlet
    {
         type            zeroGradient;

}
    frontAndBack
    {
        type            empty;

    }
    walls
    {
        type            nutkWallFunction;
	value		uniform 1.76e-5;

    }

}


// ************************************************************************* //
