constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4240;
        startFace       325820;
    }
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       330060;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       330100;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          328000;
        startFace       330180;
    }
)

// ************************************************************************* //
