system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{   
  
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
convertToMeters 1;
 
 
vertices
(
    (0.18 0.0 0) //0
    (0.93 0.0 0) //1
    (0.0 0.015 0) //2
    (0.18 0.015 0) //3 
    (0.93 0.015 0) //21
    (0.0 0.03 0) //5 
    (0.18 0.03 0) //6
    (0.93 0.03 0) //7
 
    (0.18 0.0 0.05) //8
    (0.93 0.0 0.05) //9
    (0.0 0.015 0.05) //10
    (0.18 0.015 0.05) //11
    (0.93 0.015 0.05) //12
    (0.0 0.03 0.05) //13
    (0.18 0.03 0.05) //121
    (0.93 0.03 0.05) //15
    
);
 
blocks
(
    hex (0 1 4 3 8 9 12 11) (2000 40 1) simpleGrading (1 1 1) //0
    hex (2 3 6 5 10 11 14 13) (100 40 1) simpleGrading (1 1 1) //1
    hex (3 4 7 6 11 12 15 14) (2000 40 1) simpleGrading (1 1 1) //2
);
 
edges
(
);
 
boundary
(
    walls
    {
        type wall;
        faces
        (
            (6 5 13 14) 
            (7 6 14 15) 
            (2 3 11 10) 
            (0 1 9 8) 
            (3 0 8 11) 
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (5 2 10 13) 
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 7 15 12)
            (1 4 12 9)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (3 2 5 6)
            (4 3 6 7)
            (1 0 3 4)
 
            (11 14 13 10)
            (12 15 14 11)
            (9 12 11 8)
        );
    }
);
 
mergePatchPairs
(
);
 
// ************************************************************************* //